{
  "roles": [
    {
      "id": "role-ey",
      "title": "Data Scientist & Senior Technology Consultant",
      "company": "EY LLP",
      "location": "New York, NY",
      "startDate": "2021-01",
      "endDate": null,
      "current": true,
      "bullets": [
        "Built LLM chatbots and RAG pipelines on Azure OpenAI for Private and Government clients, enabling secure analysis at enterprise scale.",
        "Developed ML and forecasting models that optimized resource allocation across federal agencies, directly reducing operational costs and manual planning overhead.",
        "Engineered NLP pipelines and a knowledge graph to extract structured insights from unstructured enterprise and policy data, accelerating analyst workflows.",
        "Delivered real-time ML forecasting dashboards in Power BI and Tableau that cut policy response times by 50% for government clients.",
        "Led cross-functional teams of 3–20 engineers, data scientists, and stakeholders, delivering high-impact analytics projects end-to-end.",
        "Integrated Azure AI services (Cognitive Search, Azure ML, Azure OpenAI) into scalable cloud architectures for regulated government environments."
      ],
      "tech": ["Python", "Azure OpenAI", "Azure ML", "Power BI", "Tableau", "SQL", "Knowledge Graphs", "RAG", "NLP"]
    },
    {
      "id": "role-parkell",
      "title": "Analyst, Regulatory & Compliance Affairs",
      "company": "Parkell Inc.",
      "location": "Edgewood, NY",
      "startDate": "2020-01",
      "endDate": "2021-12",
      "current": false,
      "bullets": [
        "Prepared FDA 510(k) submissions and Clinical Evaluation Reports for Class I/II medical devices; led EU MDR compliance transition from the legacy MDD framework.",
        "Built a SQL and NetSuite-based sales analytics and forecasting system providing real-time revenue and inventory visibility across product lines.",
        "Aligned R&D, quality, and marketing teams on regulatory strategy to reduce submission risk and accelerate product launch timelines."
      ],
      "tech": ["SQL", "NetSuite", "FDA 510(k)", "EU MDR", "Clinical Research"]
    },
    {
      "id": "role-elc",
      "title": "Data Analyst, R&D",
      "company": "The Estée Lauder Companies",
      "location": "Melville, NY",
      "startDate": "2019-01",
      "endDate": "2020-12",
      "current": false,
      "bullets": [
        "Analyzed clinical patient datasets to enhance research protocol design and built predictive analytics models supporting published R&D findings.",
        "Conducted Patient Blind studies and statistical analyses to evaluate the efficacy of skincare products, contributing to market research and product development.",
        "Modernized data models and reporting pipelines, replacing manual workflows and enabling reproducible analysis for clinical research publications."
      ],
      "tech": ["Python", "Tableau", "SQL", "Statistical Analysis", "Data Modeling"]
    },
    {
      "id": "role-northwell",
      "title": "Research Assistant — Feinstein Institute",
      "company": "Northwell Health",
      "location": "New York City Metropolitan Area",
      "startDate": "2018-05",
      "endDate": "2018-09",
      "current": false,
      "bullets": [
        "Coordinated with Neurology doctors, EMS personnel, and patients to identify and close the gap in door-to-needle time for stroke drug administration, contributing to improved survival rates.",
        "Obtained and analyzed patient data to develop statistical significance models for academic publication.",
        "Presented findings at the Feinstein Institute of Science Poster Symposium before an audience of physicians and researchers."
      ],
      "tech": ["Statistical Analysis", "Clinical Research", "Data Collection"]
    },
    {
      "id": "role-sbu-fecal",
      "title": "Student Researcher",
      "company": "Stony Brook University",
      "location": "New York City Metropolitan Area",
      "startDate": "2017-01",
      "endDate": "2019-01",
      "current": false,
      "bullets": [
        "Led clinical research on the effectiveness of the Occult Guaiac Fecal Blood Test, a test used to detect hidden blood in stool samples.",
        "Developed a prototype device to accurately analyze results from clinical diagnostic data.",
        "Utilized MATLAB, Computer Vision and data analysis software to recode an app used by clinicians in medical settings.",
        "Reviewed relevant literature, conducted statistical and biological research protocols to inform study design."
      ],
      "tech": ["MATLAB", "Clinical Research", "Data Analysis"]
    },
    {
      "id": "role-sbu-biotech",
      "title": "Student Researcher",
      "company": "Stony Brook University",
      "location": "New York City Metropolitan Area",
      "startDate": "2014-08",
      "endDate": "2015-01",
      "current": false,
      "bullets": [
        "Conducted independent and group research in SUNY Stony Brook's Biotechnology Program.",
        "Designed experimental protocols for gene expression assays.",
        "Investigated extracellular serine protease activity in Staphylococcus epidermidis."
      ],
      "tech": ["Biotechnology", "Gene Expression", "Laboratory Research"]
    },
    {
      "id": "role-intel",
      "title": "Student Researcher",
      "company": "Intel Labs (Intel ISEF / Society for Science)",
      "location": "New York City Metropolitan Area",
      "startDate": "2012-01",
      "endDate": "2015-01",
      "current": false,
      "bullets": [
        "Surveyed and analyzed student data and databases to study sleep patterns and their effects on academic and physiological outcomes.",
        "Conducted lab research testing models across multiple organ systems.",
        "Competed in the Intel Science and Engineering Fair through the Society for Science & the Public."
      ],
      "tech": ["Data Analysis", "Laboratory Research", "Survey Design"]
    }
  ],
  "education": [
    {
      "degree": "B.Eng. Biomedical Engineering",
      "institution": "Stony Brook University",
      "year": 2019
    },
    {
      "degree": "B.S. Applied Mathematics & Statistics",
      "institution": "Stony Brook University",
      "year": 2019
    }
  ],
  "certifications": [
    { "name": "Azure AI Engineer Associate", "code": "AI-102" },
    { "name": "Azure AI Fundamentals", "code": "AI-900" },
    { "name": "Azure Fundamentals", "code": "AZ-900" }
  ]
}
